{
    "projects": [
        {
            "id": 1,
            "project_name": "Random Quote Generator",
            "description": "The 1st project on the Full Stack JavaScript Techdegree. This application displays random famous quotes each time a button is clicked and after a predetermined amount of time. Following concepts were applied: Variables, Loops, Conditionals, Object literal, Random number, DOM manipulation, Time Events.",
            "technologies": [
                "JavaScript",
                "CSS",
                "HTML"
            ],
            "live_link": "https://leandro-gomessilva.github.io/JavaScript-Random-quote-generator/",
            "github_link": "https://github.com/Leandro-GomesSilva/JavaScript-Random-quote-generator",
            "image_urls": [
                "../static/images/project1-550.png",
                "../static/images/project1-1200-1.png",
                "../static/images/project1-1200-2.png"
            ]
        },
        {
            "id": 2,
            "project_name": "Data pagination and filtering",
            "description": " The 2nd project on the Full Stack JavaScript Techdegree. This application used the web development technique 'pagination' to enhance the usability of a web page. A list with a big number of elements was grouped in 9 elements and these can be displayed via navigation buttons. A search field was dynamically added, which manipulates the original list and the corresponding navigation buttons. Following concepts were applied: Pagination, Event Object, Event listeners, DOM manipulation, HTML elements.",
            "technologies": [
                "JavaScript",
                "CSS",
                "HTML"
            ],
            "live_link": "https://leandro-gomessilva.github.io/JavaScript-Data-pagination-and-filtering/",
            "github_link": "https://github.com/Leandro-GomesSilva/JavaScript-Data-pagination-and-filtering",
            "image_urls": [
                "../static/images/project2-550.png",
                "../static/images/project2-1200-1.png",
                "../static/images/project2-1200-2.png"
            ]
        },
        {
            "id": 3,
            "project_name": "Interactive form",
            "description": "The 3rd project on the Full Stack JavaScript Techdegree. In this application, JavaScript was used to enhance an interactive registration form for a fictional conference. The application applies conditional behaviour to various input fields, validates user input and provides the corresponding visual indication in real-time. Following concepts were applied: Input validation, Conditional fields, DOM manipulation, Regex, Event Object, Event listeners, CSS basic effects, HTML elements.",
            "technologies": [
                "JavaScript",
                "HTML",
                "CSS"
            ],
            "live_link": "https://leandro-gomessilva.github.io/JavaScript-Interactive-form/",
            "github_link": "https://github.com/Leandro-GomesSilva/JavaScript-Interactive-form",
            "image_urls": [
                "../static/images/project3-550.png",
                "../static/images/project3-1200-1.png",
                "../static/images/project3-1200-2.png"
            ]
        },
        {
            "id": 4,
            "project_name": "OOP Game-Show App",
            "description": "The 4th project on the Full Stack JavaScript Techdegree. This web application is a browser-based game, where JavaScript and OOP (Object-Oriented Programming) were used. The player has a limited number of tries to guess a random phrase that is displayed on the screen. They can input their guesses via a virtual keyboard that is displayed on the screen or via the physical keyboard. Finally, the web application also provides a 'local multiplayer functionality', where one player inserts the sentence and the other tries to guess it. Following concepts were applied: Object-Oriented Programming, Classes, Event Object, Event listeners, DOM manipulation.",
            "technologies": [
                "JavaScript",
                "CSS",
                "HTML"
            ],
            "live_link": "https://leandro-gomessilva.github.io/JavaScript-Object-Oriented-Programming-Game-Show-App/",
            "github_link": "https://github.com/Leandro-GomesSilva/JavaScript-Object-Oriented-Programming-Game-Show-App",
            "image_urls": [
                "../static/images/project4-550.png",
                "../static/images/project4-1200-1.png",
                "../static/images/project4-1200-2.png"
            ]
        },
        {
            "id": 5,
            "project_name": "Public API Requests",
            "description": "The 5th project on the Full Stack JavaScript Techdegree. This application makes AJAX requests to a public API and handles asynchronous data. The application grabs information about 12 fictional employees as a JSON object from the API and builds an employee directory with it. The application displays the employees in a grid as well as in a detailed modal window with toggle buttons and is also equipped with a search functionality. Following concepts were applied: AJAX, Fetch API, Public APIs, JSON, Regex, DOM manipulation, Event listeners, CSS animations, HTML elements.",
            "technologies": [
                "JavaScript",
                "CSS",
                "HTML"
            ],
            "live_link": "https://leandro-gomessilva.github.io/JavaScript-Public-API-Requests/",
            "github_link": "https://github.com/Leandro-GomesSilva/JavaScript-Public-API-Requests",
            "image_urls": [
                "../static/images/project5-550.png",
                "../static/images/project5-1200-1.png",
                "../static/images/project5-1200-2.png"
            ]
        }
    ]
}